README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>SCCodeBase</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-31 10:28:11 EEST"/>
<meta name="author" content="MC / IZ"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">SCCodeBase</h1>

<p>Managing multiple code repositories for SuperCollider Class Library made easy. 
</p>
<p>
Drop an alias of a single .sc file from your code repository folder into your User Application Extensions folder (Platform.userExtensionDir or SuperCollider/Extensions in your user Library folder), to add a menu of quarks for easy install / uninstall of code modules. 
</p>
<p>
RepQuarks is a code management mechanism for SuperCollider based on Quarks. It facilitates combining different quark projects which exist independently in folders on different locations, without having to copy these in the global Quarks directory. This gives additional freedom in working with multiple projects while keeping their files separate, and is especially valuable for sharing code with other people independently from the global Quarks, for example via git repositories.  
</p>
<p>
For more info, see: 
</p>
<p>
README_RepQuarks.rtfd
</p><div id="postamble">
<p class="author"> Author: MC / IZ
</p>
<p class="date"> Date: 2012-08-31 10:28:11 EEST</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 23</p>
</div>
</div>
</body>
</html>
